RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_eth.c
/*******************************************************************************
* Function Name  : ETH_HandleTxPkt
* Description    : Transmits a packet, from application buffer, pointed by ppkt.
* Input          : ppkt: pointer to the application's packet buffer to transmit.
*                  FrameLength: Tx Packet size.
* Return         : ETH_ERROR: in case of Tx desc owned by DMA.
*                  ETH_SUCCESS: for correct transmission.
*******************************************************************************/
uint32_t ETH_HandleTxPkt(uint8_t *ppkt, uint16_t FrameLength)
{ 
  uint32_t offset = 0;

  if((DMATxDescToSet->Status & ETH_DMATxDesc_OWN) != (uint32_t)RESET)
  {
    return ETH_ERROR;
  }

  for(offset=0; offset<FrameLength; offset++)       
  {
    (*(__IO uint8_t *)((DMATxDescToSet->Buffer1Addr) + offset)) = (*(ppkt + offset));
  }
        
  DMATxDescToSet->ControlBufferSize = (FrameLength & ETH_DMATxDesc_TBS1);
  DMATxDescToSet->Status |= ETH_DMATxDesc_LS | ETH_DMATxDesc_FS ;
  DMATxDescToSet->Status |= ETH_DMATxDesc_OWN;

  if((ETH->DMASR & ETH_DMASR_TBUS) != (uint32_t)RESET)
  {
    ETH->DMASR = ETH_DMASR_TBUS;
    ETH->DMATPDR = 0;
  }

  if((DMATxDescToSet->Status & ETH_DMATxDesc_TCH) != (uint32_t)RESET)
  {     
    DMATxDescToSet = (ETH_DMADESCTypeDef*) (DMATxDescToSet->Buffer2NextDescAddr);    
  }
  else
  {  
    if((DMATxDescToSet->Status & ETH_DMATxDesc_TER) != (uint32_t)RESET)
    {
      DMATxDescToSet = (ETH_DMADESCTypeDef*) (ETH->DMATDLAR);      
    }
    else
    {  
      DMATxDescToSet = (ETH_DMADESCTypeDef*) ((uint32_t)DMATxDescToSet + 0x10 + ((ETH->DMABMR & ETH_DMABMR_DSL) >> 2));      
    }
  }

  return ETH_SUCCESS;   
}

/*******************************************************************************
* Function Name  : ETH_HandleRxPkt
* Description    : Receives a packet and copies it to memory pointed by ppkt.
* Input          : ppkt: pointer to the application packet receive buffer.
* Return         : ETH_ERROR: if there is error in reception
*                  framelength: received packet size if packet reception is correct
*******************************************************************************/
uint32_t ETH_HandleRxPkt(uint8_t *ppkt)
{ 
  uint32_t offset = 0, framelength = 0;

  if((DMARxDescToGet->Status & ETH_DMARxDesc_OWN) != (uint32_t)RESET)
  {
    return ETH_ERROR; 
  }
  
  if(((DMARxDescToGet->Status & ETH_DMARxDesc_ES) == (uint32_t)RESET) && 
     ((DMARxDescToGet->Status & ETH_DMARxDesc_LS) != (uint32_t)RESET) &&  
     ((DMARxDescToGet->Status & ETH_DMARxDesc_FS) != (uint32_t)RESET))  
  {      
    framelength = ((DMARxDescToGet->Status & ETH_DMARxDesc_FL) >> ETH_DMARXDESC_FRAME_LENGTHSHIFT) - 4;

    for(offset=0; offset<framelength; offset++)       
    {
      (*(ppkt + offset)) = (*(__IO uint8_t *)((DMARxDescToGet->Buffer1Addr) + offset));
    }
  }
  else
  {
    framelength = ETH_ERROR;
  }

  DMARxDescToGet->Status = ETH_DMARxDesc_OWN; 

  if ((ETH->DMASR & ETH_DMASR_RBUS) != (uint32_t)RESET)  
  {
    ETH->DMASR = ETH_DMASR_RBUS;
    ETH->DMARPDR = 0;
  }
  
  if((DMARxDescToGet->ControlBufferSize & ETH_DMARxDesc_RCH) != (uint32_t)RESET)
  {     
    DMARxDescToGet = (ETH_DMADESCTypeDef*) (DMARxDescToGet->Buffer2NextDescAddr);    
  }
  else
  {   
    if((DMARxDescToGet->ControlBufferSize & ETH_DMARxDesc_RER) != (uint32_t)RESET)
    {
      DMARxDescToGet = (ETH_DMADESCTypeDef*) (ETH->DMARDLAR);      
    }
    else
    { 
      DMARxDescToGet = (ETH_DMADESCTypeDef*) ((uint32_t)DMARxDescToGet + 0x10 + ((ETH->DMABMR & ETH_DMABMR_DSL) >> 2));      
    }
  }
  
  return (framelength);  
}

/*******************************************************************************
* Function Name  : ETH_GetRxPktSize
* Description    : Get the size of received the received packet.
* Input          : None.
* Return         : framelength: received packet size
*******************************************************************************/
uint32_t ETH_GetRxPktSize(void)
{
  uint32_t frameLength = 0;
  if(((DMARxDescToGet->Status & ETH_DMARxDesc_OWN) == (uint32_t)RESET) &&
     ((DMARxDescToGet->Status & ETH_DMARxDesc_ES) == (uint32_t)RESET) &&
     ((DMARxDescToGet->Status & ETH_DMARxDesc_LS) != (uint32_t)RESET) &&
     ((DMARxDescToGet->Status & ETH_DMARxDesc_FS) != (uint32_t)RESET))
  {
    frameLength = ETH_GetDMARxDescFrameLength(DMARxDescToGet);
  }
 
 return frameLength;
}

/*******************************************************************************
* Function Name  : ETH_DropRxPkt
* Description    : Drop a Received packet.
* Input          : None.
* Return         : None
*******************************************************************************/
void ETH_DropRxPkt(void)
{
  DMARxDescToGet->Status = ETH_DMARxDesc_OWN;  

  if((DMARxDescToGet->ControlBufferSize & ETH_DMARxDesc_RCH) != (uint32_t)RESET)
  {
    DMARxDescToGet = (ETH_DMADESCTypeDef*) (DMARxDescToGet->Buffer2NextDescAddr);
  }
  else
  {
    if((DMARxDescToGet->ControlBufferSize & ETH_DMARxDesc_RER) != (uint32_t)RESET)
    {
      DMARxDescToGet = (ETH_DMADESCTypeDef*) (ETH->DMARDLAR);
    }
    else
    {
      DMARxDescToGet = (ETH_DMADESCTypeDef*) ((uint32_t)DMARxDescToGet + 0x10 + ((ETH->DMABMR & ETH_DMABMR_DSL) >> 2));
    }
  }
}

/*******************************************************************************
* Function Name  : ETH_ReadPHYRegister
* Description    : Read a PHY register.
* Input          : PHYAddress: PHY device address, is the index of one of supported 32 PHY devices.
*                  PHYReg: PHY register address, is the index of one of the 32 PHY register.
* Return         : ETH_ERROR: in case of timeout.
*                  MAC MIIDR register value: Data read from the selected PHY register.
*******************************************************************************/
uint16_t ETH_ReadPHYRegister(uint16_t PHYAddress, uint16_t PHYReg)
{
  uint32_t tmpreg = 0;     
  __IO uint32_t timeout = 0;
  
  tmpreg = ETH->MACMIIAR;
  tmpreg &= ~MACMIIAR_CR_MASK;
  tmpreg |=(((uint32_t)PHYAddress<<11) & ETH_MACMIIAR_PA);
  tmpreg |=(((uint32_t)PHYReg<<6) & ETH_MACMIIAR_MR);
  tmpreg &= ~ETH_MACMIIAR_MW;
  tmpreg |= ETH_MACMIIAR_MB;
  ETH->MACMIIAR = tmpreg;

  do
  {
    timeout++;
    tmpreg = ETH->MACMIIAR;
  } while ((tmpreg & ETH_MACMIIAR_MB) && (timeout < (uint32_t)PHY_READ_TO));

