RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_eth.c
  if(timeout == PHY_READ_TO)
  {
    return (uint16_t)ETH_ERROR;
  }
  
  return (uint16_t)(ETH->MACMIIDR);
}

/*******************************************************************************
* Function Name  : ETH_WritePHYRegister
* Description    : Write to a PHY register.
* Input          : PHYAddress: PHY device address, is the index of one of supported 32 PHY devices.
*                  PHYReg: PHY register address, is the index of one of the 32 PHY register.
*                  PHYValue: the value to write.
* Return         : ETH_ERROR: in case of timeout.
*                  ETH_SUCCESS: for correct write
*******************************************************************************/
uint32_t ETH_WritePHYRegister(uint16_t PHYAddress, uint16_t PHYReg, uint16_t PHYValue)
{
  uint32_t tmpreg = 0;     
  __IO uint32_t timeout = 0;
  
  tmpreg = ETH->MACMIIAR;
  tmpreg &= ~MACMIIAR_CR_MASK;
  tmpreg |=(((uint32_t)PHYAddress<<11) & ETH_MACMIIAR_PA);
  tmpreg |=(((uint32_t)PHYReg<<6) & ETH_MACMIIAR_MR);
  tmpreg |= ETH_MACMIIAR_MW;
  tmpreg |= ETH_MACMIIAR_MB;
  ETH->MACMIIDR = PHYValue;
  ETH->MACMIIAR = tmpreg;

  do
  {
    timeout++;
    tmpreg = ETH->MACMIIAR;
  } while ((tmpreg & ETH_MACMIIAR_MB) && (timeout < (uint32_t)PHY_WRITE_TO));

  if(timeout >= PHY_WRITE_TO)
  {
    return ETH_ERROR;
  }

  return ETH_SUCCESS;  
}

/*******************************************************************************
* Function Name  : ETH_PHYLoopBackCmd
* Description    : Enables or disables the PHY loopBack mode.
* Input          : PHYAddress: PHY device address, is the index of one of supported 32 PHY devices.
*                  NewState: new state of the PHY loopBack mode.
* Return         : ETH_ERROR: in case of bad PHY configuration.
*                  ETH_SUCCESS: for correct PHY configuration.
*******************************************************************************/
uint32_t ETH_PHYLoopBackCmd(uint16_t PHYAddress, FunctionalState NewState)
{
  uint16_t tmpreg = 0;
    
  tmpreg = ETH_ReadPHYRegister(PHYAddress, PHY_BCR); 
  
  if (NewState != DISABLE)
  {
    tmpreg |= PHY_Loopback;  
  }
  else
  {
    tmpreg &= (uint16_t)(~(uint16_t)PHY_Loopback);
  }

  if(ETH_WritePHYRegister(PHYAddress, PHY_BCR, tmpreg) != (uint32_t)RESET)
  {
    return ETH_SUCCESS;
  }
  else
  {
    return ETH_ERROR; 
  }   
}

/*******************************************************************************
* Function Name  : ETH_MACTransmissionCmd
* Description    : Enables or disables the MAC transmission.
* Input          : NewState: new state of the MAC transmission.
* Return         : None.
*******************************************************************************/
void ETH_MACTransmissionCmd(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ETH->MACCR |= ETH_MACCR_TE;  
  }
  else
  {
    ETH->MACCR &= ~ETH_MACCR_TE;
  }
}

/*******************************************************************************
* Function Name  : ETH_MACReceptionCmd
* Description    : Enables or disables the MAC reception.
* Input          : NewState: new state of the MAC reception.
* Return         : None.
*******************************************************************************/
void ETH_MACReceptionCmd(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ETH->MACCR |= ETH_MACCR_RE;  
  }
  else
  {
    ETH->MACCR &= ~ETH_MACCR_RE;
  }
}

/*******************************************************************************
* Function Name  : ETH_GetFlowControlBusyStatus
* Description    : Enables or disables the MAC reception.
* Input          : None
* Return         : The new state of flow control busy status bit (SET or RESET)..
*******************************************************************************/
FlagStatus ETH_GetFlowControlBusyStatus(void)
{
  FlagStatus bitstatus = RESET;

  if ((ETH->MACFCR & ETH_MACFCR_FCBBPA) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/*******************************************************************************
* Function Name  : ETH_InitiatePauseControlFrame
* Description    : Initiate a Pause Control Frame (Full-duplex only).
* Input          : None.
* Return         : None.
*******************************************************************************/
void ETH_InitiatePauseControlFrame(void)  
{ 
  ETH->MACFCR |= ETH_MACFCR_FCBBPA;  
}

/*******************************************************************************
* Function Name  : ETH_BackPressureActivationCmd
* Description    : Enables or disables the MAC BackPressure operation activation (Half-duplex only).
* Input          : NewState: new state of the MAC BackPressure operation activation.
* Return         : None.
*******************************************************************************/
void ETH_BackPressureActivationCmd(FunctionalState NewState)   
{
  if (NewState != DISABLE)
  {
    ETH->MACFCR |= ETH_MACFCR_FCBBPA; 
  }
  else
  {
    ETH->MACFCR &= ~ETH_MACFCR_FCBBPA; 
  } 
}

/*******************************************************************************
* Function Name  : ETH_GetMACFlagStatus
* Description    : Checks whether the specified ETHERNET MAC flag is set or not.
* Input          : ETH_MAC_FLAG: specifies the flag to check.
* Return         : The new state of ETHERNET MAC flag (SET or RESET).
*******************************************************************************/
FlagStatus ETH_GetMACFlagStatus(uint32_t ETH_MAC_FLAG)
{
  FlagStatus bitstatus = RESET;

  if ((ETH->MACSR & ETH_MAC_FLAG) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/*******************************************************************************
* Function Name  : ETH_GetMACITStatus
* Description    : Checks whether the specified ETHERNET MAC interrupt has occurred or not.
* Input          : ETH_MAC_IT: specifies the interrupt source to check.
* Return         : The new state of ETHERNET MAC interrupt (SET or RESET).
*******************************************************************************/
ITStatus ETH_GetMACITStatus(uint32_t ETH_MAC_IT)
{
    FlagStatus bitstatus = RESET;

    if ((ETH->MACSR & ETH_MAC_IT) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

