RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_eth.c
    return bitstatus;
}

/*******************************************************************************
* Function Name  : ETH_MACITConfig
* Description    : Enables or disables the specified ETHERNET MAC interrupts.
* Input          : ETH_MAC_IT: specifies the ETHERNET MAC interrupt sources to be.
*                  NewState: new state of the specified ETHERNET MAC interrupts.
* Return         : None.
*******************************************************************************/
void ETH_MACITConfig(uint32_t ETH_MAC_IT, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ETH->MACIMR &= (~(uint32_t)ETH_MAC_IT);
  }
  else
  {
    ETH->MACIMR |= ETH_MAC_IT;
  }
}

/*******************************************************************************
* Function Name  : ETH_MACAddressConfig
* Description    : Configures the selected MAC address.
* Input          : MacAddr: The MAC addres to configure.
*                  ETH_MAC_Address0 : MAC Address0
*                  ETH_MAC_Address1 : MAC Address1
*                  ETH_MAC_Address2 : MAC Address2
*                  ETH_MAC_Address3 : MAC Address3
*                  Addr: Pointer on MAC address buffer data (6 bytes).
* Return         : None.
*******************************************************************************/
void ETH_MACAddressConfig(uint32_t MacAddr, uint8_t *Addr)
{
  uint32_t tmpreg;
  
  tmpreg = ((uint32_t)Addr[5] << 8) | (uint32_t)Addr[4];
  (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + MacAddr)) = tmpreg;
  tmpreg = ((uint32_t)Addr[3] << 24) | ((uint32_t)Addr[2] << 16) | ((uint32_t)Addr[1] << 8) | Addr[0];
 
  (*(__IO uint32_t *) (ETH_MAC_ADDR_LBASE + MacAddr)) = tmpreg;
}

/*******************************************************************************
* Function Name  : ETH_GetMACAddress
* Description    : Get the selected MAC address.
* Input          : MacAddr: The MAC address to return.
*                  ETH_MAC_Address0 : MAC Address0
*                  ETH_MAC_Address1 : MAC Address1
*                  ETH_MAC_Address2 : MAC Address2
*                  ETH_MAC_Address3 : MAC Address3
*                  Addr: Pointer on MAC address buffer data (6 bytes).
* Return         : None.
*******************************************************************************/
void ETH_GetMACAddress(uint32_t MacAddr, uint8_t *Addr)
{
  uint32_t tmpreg;
  
  tmpreg =(*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + MacAddr));
 
  Addr[5] = ((tmpreg >> 8) & (uint8_t)0xFF);
  Addr[4] = (tmpreg & (uint8_t)0xFF);
  tmpreg =(*(__IO uint32_t *) (ETH_MAC_ADDR_LBASE + MacAddr));
  Addr[3] = ((tmpreg >> 24) & (uint8_t)0xFF);
  Addr[2] = ((tmpreg >> 16) & (uint8_t)0xFF);
  Addr[1] = ((tmpreg >> 8 ) & (uint8_t)0xFF);
  Addr[0] = (tmpreg & (uint8_t)0xFF);
}

/*******************************************************************************
* Function Name  : ETH_MACAddressPerfectFilterCmd
* Description    : Enables or disables the Address filter module uses the specified.
* Input          : MacAddr: The MAC address to return.
*                  ETH_MAC_Address1 : MAC Address1
*                  ETH_MAC_Address2 : MAC Address2
*                  ETH_MAC_Address3 : MAC Address3
*                  NewState: new state of the specified ETHERNET MAC address use.
* Return         : None.
*******************************************************************************/
void ETH_MACAddressPerfectFilterCmd(uint32_t MacAddr, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + MacAddr)) |= ETH_MACA1HR_AE;
  }
  else
  {
    (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + MacAddr)) &=(~(uint32_t)ETH_MACA1HR_AE);
  }
}

/*******************************************************************************
* Function Name  : ETH_MACAddressFilterConfig
* Description    : Set the filter type for the specified ETHERNET MAC address.
* Input          : MacAddr: specifies the ETHERNET MAC address.
*                  ETH_MAC_Address1 : MAC Address1
*                  ETH_MAC_Address2 : MAC Address2
*                  ETH_MAC_Address3 : MAC Address3
*                  Filter: specifies the used frame received field for comparaison.
*                  ETH_MAC_AddressFilter_SA : MAC Address is used to compare with the
*                                             SA fields of the received frame.
*                  ETH_MAC_AddressFilter_DA : MAC Address is used to compare with the
*                                             DA fields of the received frame.
* Return         : None.
*******************************************************************************/
void ETH_MACAddressFilterConfig(uint32_t MacAddr, uint32_t Filter)
{
  if (Filter != ETH_MAC_AddressFilter_DA)
  {
    (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + MacAddr)) |= ETH_MACA1HR_SA;
  }
  else
  {
    (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + MacAddr)) &=(~(uint32_t)ETH_MACA1HR_SA);
  }
}

/*******************************************************************************
* Function Name  : ETH_MACAddressMaskBytesFilterConfig
* Description    : Set the filter type for the specified ETHERNET MAC address.
* Input          : MacAddr: specifies the ETHERNET MAC address.
*                  ETH_MAC_Address1 : MAC Address1
*                  ETH_MAC_Address2 : MAC Address2
*                  ETH_MAC_Address3 : MAC Address3
*                  MaskByte: specifies the used address bytes for comparaison
*                  ETH_MAC_AddressMask_Byte5 : Mask MAC Address high reg bits [7:0].
*                  ETH_MAC_AddressMask_Byte4 : Mask MAC Address low reg bits [31:24].
*                  ETH_MAC_AddressMask_Byte3 : Mask MAC Address low reg bits [23:16].
*                  ETH_MAC_AddressMask_Byte2 : Mask MAC Address low reg bits [15:8].
*                  ETH_MAC_AddressMask_Byte1 : Mask MAC Address low reg bits [7:0].
* Return         : None.
*******************************************************************************/
void ETH_MACAddressMaskBytesFilterConfig(uint32_t MacAddr, uint32_t MaskByte)
{
  (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + MacAddr)) &=(~(uint32_t)ETH_MACA1HR_MBC);
  (*(__IO uint32_t *) (ETH_MAC_ADDR_HBASE + MacAddr)) |= MaskByte;
}

