RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_eth.c
/*******************************************************************************
* Function Name  : ETH_DMATxDescChainInit
* Description    : Initializes the DMA Tx descriptors in chain mode.
* Input          : DMATxDescTab: Pointer on the first Tx desc list
*                  TxBuff: Pointer on the first TxBuffer list
*                  TxBuffCount: Number of the used Tx desc in the list
* Return         : None.
*******************************************************************************/
void ETH_DMATxDescChainInit(ETH_DMADESCTypeDef *DMATxDescTab, uint8_t* TxBuff, uint32_t TxBuffCount)
{
  uint32_t i = 0;
  ETH_DMADESCTypeDef *DMATxDesc;
  
  DMATxDescToSet = DMATxDescTab;

  for(i=0; i < TxBuffCount; i++)
  {
    DMATxDesc = DMATxDescTab + i;
    DMATxDesc->Status = ETH_DMATxDesc_TCH;
    DMATxDesc->Buffer1Addr = (uint32_t)(&TxBuff[i*ETH_MAX_PACKET_SIZE]);
    
    if(i < (TxBuffCount-1))
    {
      DMATxDesc->Buffer2NextDescAddr = (uint32_t)(DMATxDescTab+i+1);
    }
    else
    {
      DMATxDesc->Buffer2NextDescAddr = (uint32_t) DMATxDescTab;  
    }
  }
   
  ETH->DMATDLAR = (uint32_t) DMATxDescTab;
}

/*******************************************************************************
* Function Name  : ETH_DMATxDescRingInit
* Description    : Initializes the DMA Tx descriptors in ring mode.
* Input          : DMATxDescTab: Pointer on the first Tx desc list.
*                  TxBuff1: Pointer on the first TxBuffer1 list.
*                  TxBuff2: Pointer on the first TxBuffer2 list.
*                  TxBuffCount: Number of the used Tx desc in the list.
* Return         : None.
*******************************************************************************/
void ETH_DMATxDescRingInit(ETH_DMADESCTypeDef *DMATxDescTab, uint8_t *TxBuff1, uint8_t *TxBuff2, uint32_t TxBuffCount)
{
  uint32_t i = 0;
  ETH_DMADESCTypeDef *DMATxDesc;
 
  DMATxDescToSet = DMATxDescTab;

  for(i=0; i < TxBuffCount; i++)
  {
    DMATxDesc = DMATxDescTab + i;
    DMATxDesc->Buffer1Addr = (uint32_t)(&TxBuff1[i*ETH_MAX_PACKET_SIZE]);
    DMATxDesc->Buffer2NextDescAddr = (uint32_t)(&TxBuff2[i*ETH_MAX_PACKET_SIZE]);
    
    if(i == (TxBuffCount-1))
    {
      DMATxDesc->Status = ETH_DMATxDesc_TER;
    }
  }
   
  ETH->DMATDLAR =  (uint32_t) DMATxDescTab;
}

/*******************************************************************************
* Function Name  : ETH_GetDMATxDescFlagStatus
* Description    : Checks whether the specified ETHERNET DMA Tx Desc flag is set or not.
* Input          : DMATxDesc: pointer on a DMA Tx descriptor
*                  ETH_DMATxDescFlag: specifies the flag to check.
*                  TxBuff2: Pointer on the first TxBuffer2 list.
*                  TxBuffCount: Number of the used Tx desc in the list.
*                  ETH_DMATxDesc_OWN : OWN bit: descriptor is owned by DMA engine
*                  ETH_DMATxDesc_IC  : Interrupt on completetion
*                  ETH_DMATxDesc_LS  : Last Segment
*                  ETH_DMATxDesc_FS  : First Segment
*                   ETH_DMATxDesc_DC  : Disable CRC
*                  ETH_DMATxDesc_DP  : Disable Pad
*                  ETH_DMATxDesc_TTSE: Transmit Time Stamp Enable
*                  ETH_DMATxDesc_TER : Transmit End of Ring
*                  ETH_DMATxDesc_TCH : Second Address Chained
*                  ETH_DMATxDesc_TTSS: Tx Time Stamp Status
*                  ETH_DMATxDesc_IHE : IP Header Error
*                  ETH_DMATxDesc_ES  : Error summary
*                  ETH_DMATxDesc_JT  : Jabber Timeout
*                  ETH_DMATxDesc_FF  : Frame Flushed: DMA/MTL flushed the frame due to SW flush
*                  ETH_DMATxDesc_PCE : Payload Checksum Error
*                  ETH_DMATxDesc_LCA : Loss of Carrier: carrier lost during tramsmission
*                  ETH_DMATxDesc_NC  : No Carrier: no carrier signal from the tranceiver
*                  ETH_DMATxDesc_LCO : Late Collision: transmission aborted due to collision
*                  ETH_DMATxDesc_EC  : Excessive Collision: transmission aborted after 16 collisions
*                  ETH_DMATxDesc_VF  : VLAN Frame
*                  ETH_DMATxDesc_CC  : Collision Count
*                  ETH_DMATxDesc_ED  : Excessive Deferral
*                  ETH_DMATxDesc_UF  : Underflow Error: late data arrival from the memory
*                  ETH_DMATxDesc_DB  : Deferred Bit
* Return         : The new state of ETH_DMATxDescFlag (SET or RESET).
*******************************************************************************/
FlagStatus ETH_GetDMATxDescFlagStatus(ETH_DMADESCTypeDef *DMATxDesc, uint32_t ETH_DMATxDescFlag)
{
    FlagStatus bitstatus = RESET;

    if ((DMATxDesc->Status & ETH_DMATxDescFlag) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*******************************************************************************
* Function Name  : ETH_GetDMATxDescCollisionCount
* Description    : Returns the specified ETHERNET DMA Tx Desc collision count.
* Input          : pointer on a DMA Tx descriptor.
* Return         : The Transmit descriptor collision counter value.
*******************************************************************************/
uint32_t ETH_GetDMATxDescCollisionCount(ETH_DMADESCTypeDef *DMATxDesc)
{
  return ((DMATxDesc->Status & ETH_DMATxDesc_CC) >> ETH_DMATXDESC_COLLISION_COUNTSHIFT);
}


/*******************************************************************************
* Function Name  : ETH_SetDMATxDescOwnBit
* Description    : Set the specified DMA Tx Desc Own bit.
* Input          : DMATxDesc: Pointer on a Tx desc
* Return         : None
*******************************************************************************/
void ETH_SetDMATxDescOwnBit(ETH_DMADESCTypeDef *DMATxDesc)
{
  DMATxDesc->Status |= ETH_DMATxDesc_OWN;
}

/*******************************************************************************
* Function Name  : ETH_DMATxDescTransmitITConfig
* Description    : Enables or disables the specified DMA Tx Desc Transmit interrupt.
* Input          : Pointer on a Tx desc.
*                  NewState: new state of the DMA Tx Desc transmit interrupt.
* Return         : None.
*******************************************************************************/
void ETH_DMATxDescTransmitITConfig(ETH_DMADESCTypeDef *DMATxDesc, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    DMATxDesc->Status |= ETH_DMATxDesc_IC;
  }
  else
  {
    DMATxDesc->Status &=(~(uint32_t)ETH_DMATxDesc_IC);
  }
}

