RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_eth.c
/*******************************************************************************
* Function Name  : ETH_DMATxDescFrameSegmentConfig
* Description    : Enables or disables the specified DMA Tx Desc Transmit interrupt.
* Input          : PDMATxDesc: Pointer on a Tx desc.
*                  ETH_DMATxDesc_FirstSegment : actual Tx desc contain first segment.
* Return         : None.
*******************************************************************************/
void ETH_DMATxDescFrameSegmentConfig(ETH_DMADESCTypeDef *DMATxDesc, uint32_t DMATxDesc_FrameSegment)
{
  DMATxDesc->Status |= DMATxDesc_FrameSegment;
}

/*******************************************************************************
* Function Name  : ETH_DMATxDescChecksumInsertionConfig
* Description    : Selects the specified ETHERNET DMA Tx Desc Checksum Insertion.
* Input          : DMATxDesc: pointer on a DMA Tx descriptor.
*                  DMATxDesc_Checksum: specifies is the DMA Tx desc checksum insertion.
* Return         : None.
*******************************************************************************/
void ETH_DMATxDescChecksumInsertionConfig(ETH_DMADESCTypeDef *DMATxDesc, uint32_t DMATxDesc_Checksum)
{
  DMATxDesc->Status |= DMATxDesc_Checksum;
}

/*******************************************************************************
* Function Name  : ETH_DMATxDescCRCCmd
* Description    : Enables or disables the DMA Tx Desc CRC.
* Input          : DMATxDesc: pointer on a DMA Tx descriptor
*                  NewState: new state of the specified DMA Tx Desc CRC.
* Return         : None.
*******************************************************************************/
void ETH_DMATxDescCRCCmd(ETH_DMADESCTypeDef *DMATxDesc, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    DMATxDesc->Status &= (~(uint32_t)ETH_DMATxDesc_DC);
  }
  else
  {
    DMATxDesc->Status |= ETH_DMATxDesc_DC; 
  }
}

/*******************************************************************************
* Function Name  : ETH_DMATxDescEndOfRingCmd
* Description    :Enables or disables the DMA Tx Desc end of ring.
* Input          : DMATxDesc: pointer on a DMA Tx descriptor.
*                  NewState: new state of the specified DMA Tx Desc end of ring.
* Return         : None.
*******************************************************************************/
void ETH_DMATxDescEndOfRingCmd(ETH_DMADESCTypeDef *DMATxDesc, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    DMATxDesc->Status |= ETH_DMATxDesc_TER;  
  }
  else
  {
    DMATxDesc->Status &= (~(uint32_t)ETH_DMATxDesc_TER); 
  }
}

/*******************************************************************************
* Function Name  : ETH_DMATxDescSecondAddressChainedCmd
* Description    : Enables or disables the DMA Tx Desc second address chained.
* Input          : DMATxDesc: pointer on a DMA Tx descriptor
*                  NewState: new state of the specified DMA Tx Desc second address chained.
* Return         : None.
*******************************************************************************/
void ETH_DMATxDescSecondAddressChainedCmd(ETH_DMADESCTypeDef *DMATxDesc, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    DMATxDesc->Status |= ETH_DMATxDesc_TCH;  
  }
  else
  {
    DMATxDesc->Status &=(~(uint32_t)ETH_DMATxDesc_TCH); 
  }
}

/*******************************************************************************
* Function Name  : ETH_DMATxDescShortFramePaddingCmd
* Description    : Enables or disables the DMA Tx Desc padding for frame shorter than 64 bytes.
* Input          : DMATxDesc: pointer on a DMA Tx descriptor.
*                  NewState: new state of the specified DMA Tx Desc padding for frame shorter than 64 bytes.
* Return         : None.
*******************************************************************************/
void ETH_DMATxDescShortFramePaddingCmd(ETH_DMADESCTypeDef *DMATxDesc, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    DMATxDesc->Status &= (~(uint32_t)ETH_DMATxDesc_DP);
  }
  else
  {
    DMATxDesc->Status |= ETH_DMATxDesc_DP; 
  }
}

/*******************************************************************************
* Function Name  : ETH_DMATxDescTimeStampCmd
* Description    : Enables or disables the DMA Tx Desc time stamp.
* Input          : DMATxDesc: pointer on a DMA Tx descriptor
*                  NewState: new state of the specified DMA Tx Desc time stamp.
* Return         : None.
*******************************************************************************/
void ETH_DMATxDescTimeStampCmd(ETH_DMADESCTypeDef *DMATxDesc, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    DMATxDesc->Status |= ETH_DMATxDesc_TTSE;  
  }
  else
  {
    DMATxDesc->Status &=(~(uint32_t)ETH_DMATxDesc_TTSE); 
  }
}

/*******************************************************************************
* Function Name  : ETH_DMATxDescBufferSizeConfig
* Description    : Configures the specified DMA Tx Desc buffer1 and buffer2 sizes.
* Input          : DMATxDesc: Pointer on a Tx desc.
*                  BufferSize1: specifies the Tx desc buffer1 size.
*                  RxBuff2: Pointer on the first RxBuffer2 list
*                  BufferSize2: specifies the Tx desc buffer2 size (put "0" if not used).
* Return         : None.
*******************************************************************************/
void ETH_DMATxDescBufferSizeConfig(ETH_DMADESCTypeDef *DMATxDesc, uint32_t BufferSize1, uint32_t BufferSize2)
{
  DMATxDesc->ControlBufferSize |= (BufferSize1 | (BufferSize2 << ETH_DMATXDESC_BUFFER2_SIZESHIFT));
}

/*******************************************************************************
* Function Name  : ETH_DMARxDescChainInit
* Description    : Initializes the DMA Rx descriptors in chain mode.
* Input          : DMARxDescTab: Pointer on the first Rx desc list.
*                  RxBuff: Pointer on the first RxBuffer list.
*                  RxBuffCount: Number of the used Rx desc in the list.
* Return         : None.
*******************************************************************************/
void ETH_DMARxDescChainInit(ETH_DMADESCTypeDef *DMARxDescTab, uint8_t *RxBuff, uint32_t RxBuffCount)
{
  uint32_t i = 0;
  ETH_DMADESCTypeDef *DMARxDesc;
  
  DMARxDescToGet = DMARxDescTab; 

