RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_eth.c
  for(i=0; i < RxBuffCount; i++)
  {
    DMARxDesc = DMARxDescTab+i;
    DMARxDesc->Status = ETH_DMARxDesc_OWN;
    DMARxDesc->ControlBufferSize = ETH_DMARxDesc_RCH | (uint32_t)ETH_MAX_PACKET_SIZE;  
    DMARxDesc->Buffer1Addr = (uint32_t)(&RxBuff[i*ETH_MAX_PACKET_SIZE]);
    
    if(i < (RxBuffCount-1))
    {
      DMARxDesc->Buffer2NextDescAddr = (uint32_t)(DMARxDescTab+i+1); 
    }
    else
    {
      DMARxDesc->Buffer2NextDescAddr = (uint32_t)(DMARxDescTab); 
    }
  }
   
  ETH->DMARDLAR = (uint32_t) DMARxDescTab;  

}

/*******************************************************************************
* Function Name  : ETH_DMARxDescRingInit
* Description    : Initializes the DMA Rx descriptors in ring mode.
* Input          : DMARxDescTab: Pointer on the first Rx desc list.
*                  RxBuff1: Pointer on the first RxBuffer1 list.
*                  RxBuff2: Pointer on the first RxBuffer2 list
*                  RxBuffCount: Number of the used Rx desc in the list.
* Return         : None.
*******************************************************************************/
void ETH_DMARxDescRingInit(ETH_DMADESCTypeDef *DMARxDescTab, uint8_t *RxBuff1, uint8_t *RxBuff2, uint32_t RxBuffCount)
{
  uint32_t i = 0;
  ETH_DMADESCTypeDef *DMARxDesc;

  DMARxDescToGet = DMARxDescTab; 

  for(i=0; i < RxBuffCount; i++)
  {
    DMARxDesc = DMARxDescTab+i; 
    DMARxDesc->Status = ETH_DMARxDesc_OWN; 
    DMARxDesc->ControlBufferSize = ETH_MAX_PACKET_SIZE;  
    DMARxDesc->Buffer1Addr = (uint32_t)(&RxBuff1[i*ETH_MAX_PACKET_SIZE]);
    DMARxDesc->Buffer2NextDescAddr = (uint32_t)(&RxBuff2[i*ETH_MAX_PACKET_SIZE]); 
    
    if(i == (RxBuffCount-1))
    {
      DMARxDesc->ControlBufferSize |= ETH_DMARxDesc_RER;
    }
  }
   
  ETH->DMARDLAR = (uint32_t) DMARxDescTab;  
}

/*******************************************************************************
* Function Name  : ETH_GetDMARxDescFlagStatus
* Description    : Checks whether the specified ETHERNET Rx Desc flag is set or not.
* Input          : DMARxDesc: pointer on a DMA Rx descriptor.
*                  ETH_DMARxDescFlag: specifies the flag to check.
*                  ETH_DMARxDesc_OWN:         OWN bit: descriptor is owned by DMA engine
*                  ETH_DMARxDesc_AFM:         DA Filter Fail for the rx frame
*                  ETH_DMARxDesc_ES:          Error summary
*                  ETH_DMARxDesc_DE:          Desciptor error: no more descriptors for receive frame
*                  ETH_DMARxDesc_SAF:         SA Filter Fail for the received frame
*                  ETH_DMARxDesc_LE:          Frame size not matching with length field
*                  ETH_DMARxDesc_OE:          Overflow Error: Frame was damaged due to buffer overflow
*                  ETH_DMARxDesc_VLAN:        VLAN Tag: received frame is a VLAN frame
*                  ETH_DMARxDesc_FS:          First descriptor of the frame
*                  ETH_DMARxDesc_LS:          Last descriptor of the frame
*                  ETH_DMARxDesc_IPV4HCE:     IPC Checksum Error/Giant Frame: Rx Ipv4 header checksum error
*                  ETH_DMARxDesc_LC:          Late collision occurred during reception
*                  ETH_DMARxDesc_FT:          Frame type - Ethernet, otherwise 802.3
*                  ETH_DMARxDesc_RWT:         Receive Watchdog Timeout: watchdog timer expired during reception
*                  ETH_DMARxDesc_RE:          Receive error: error reported by MII interface
*                  ETH_DMARxDesc_DE:          Dribble bit error: frame contains non int multiple of 8 bits
*                  ETH_DMARxDesc_CE:          CRC error
*                  ETH_DMARxDesc_MAMPCE:      Rx MAC Address/Payload Checksum Error: Rx MAC address matched/ Rx Payload Checksum Error
* Return         : The new state of ETH_DMARxDescFlag (SET or RESET).
*******************************************************************************/
FlagStatus ETH_GetDMARxDescFlagStatus(ETH_DMADESCTypeDef *DMARxDesc, uint32_t ETH_DMARxDescFlag)
{
    FlagStatus bitstatus = RESET;

    if ((DMARxDesc->Status & ETH_DMARxDescFlag) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*******************************************************************************
* Function Name  : ETH_SetDMARxDescOwnBit
* Description    : Set the specified DMA Rx Desc Own bit.
* Input          : DMARxDesc: Pointer on a Rx desc
* Return         : None.
*******************************************************************************/
void ETH_SetDMARxDescOwnBit(ETH_DMADESCTypeDef *DMARxDesc)
{
  DMARxDesc->Status |= ETH_DMARxDesc_OWN;
}

/*******************************************************************************
* Function Name  : ETH_GetDMARxDescFrameLength
* Description    : Returns the specified DMA Rx Desc frame length.
* Input          : DMARxDesc: pointer on a DMA Rx descriptor
* Return         : The Rx descriptor received frame length.
*******************************************************************************/
uint32_t ETH_GetDMARxDescFrameLength(ETH_DMADESCTypeDef *DMARxDesc)
{
  return ((DMARxDesc->Status & ETH_DMARxDesc_FL) >> ETH_DMARXDESC_FRAME_LENGTHSHIFT);
}

/*******************************************************************************
* Function Name  : ETH_DMARxDescReceiveITConfig
* Description    : Enables or disables the specified DMA Rx Desc receive interrupt.
* Input          : DMARxDesc: Pointer on a Rx desc
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void ETH_DMARxDescReceiveITConfig(ETH_DMADESCTypeDef *DMARxDesc, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    DMARxDesc->ControlBufferSize &=(~(uint32_t)ETH_DMARxDesc_DIC);
  }
  else
  {
    DMARxDesc->ControlBufferSize |= ETH_DMARxDesc_DIC;
  }
}

/*******************************************************************************
* Function Name  : ETH_DMARxDescEndOfRingCmd
* Description    : Enables or disables the DMA Rx Desc end of ring.
* Input          : DMARxDesc: pointer on a DMA Rx descriptor.
*                  NewState: new state of the specified DMA Rx Desc end of ring.
* Return         : None.
*******************************************************************************/
void ETH_DMARxDescEndOfRingCmd(ETH_DMADESCTypeDef *DMARxDesc, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    DMARxDesc->ControlBufferSize |= ETH_DMARxDesc_RER;  
  }
  else
  {
    DMARxDesc->ControlBufferSize &=(~(uint32_t)ETH_DMARxDesc_RER); 
  }
}

