RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_eth.c
/*******************************************************************************
* Function Name  : ETH_DMARxDescSecondAddressChainedCmd
* Description    : Returns the specified ETHERNET DMA Rx Desc buffer size.
* Input          : DMARxDesc: pointer on a DMA Rx descriptor
*                  NewState: new state of the specified DMA Rx Desc second address chained.
* Return         : None.
*******************************************************************************/
void ETH_DMARxDescSecondAddressChainedCmd(ETH_DMADESCTypeDef *DMARxDesc, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    DMARxDesc->ControlBufferSize |= ETH_DMARxDesc_RCH;  
  }
  else
  {
    DMARxDesc->ControlBufferSize &=(~(uint32_t)ETH_DMARxDesc_RCH); 
  }
}

/*******************************************************************************
* Function Name  : ETH_GetDMARxDescBufferSize
* Description    : Returns the specified ETHERNET DMA Rx Desc buffer size.
* Input          : DMARxDesc: pointer on a DMA Rx descriptor.
*                  DMARxDesc_Buffer: specifies the DMA Rx Desc buffer.
*                  ETH_DMARxDesc_Buffer1 : DMA Rx Desc Buffer1
*                  ETH_DMARxDesc_Buffer2 : DMA Rx Desc Buffer2
* Return         : The Receive descriptor frame length.
*******************************************************************************/
uint32_t ETH_GetDMARxDescBufferSize(ETH_DMADESCTypeDef *DMARxDesc, uint32_t DMARxDesc_Buffer)
{
  if(DMARxDesc_Buffer != ETH_DMARxDesc_Buffer1)
  {
    return ((DMARxDesc->ControlBufferSize & ETH_DMARxDesc_RBS2) >> ETH_DMARXDESC_BUFFER2_SIZESHIFT); 
  }
  else
  {
    return (DMARxDesc->ControlBufferSize & ETH_DMARxDesc_RBS1); 
  }
}

/*******************************************************************************
* Function Name  : ETH_SoftwareReset
* Description    : Resets all MAC subsystem internal registers and logic.
* Input          : None.
* Return         : None.
*******************************************************************************/
void ETH_SoftwareReset(void)
{
  ETH->DMABMR |= ETH_DMABMR_SR;
}

/*******************************************************************************
* Function Name  : ETH_GetSoftwareResetStatus
* Description    : Checks whether the ETHERNET software reset bit is set or not.
* Input          : None.
* Return         : The new state of DMA Bus Mode register SR bit (SET or RESET).
*******************************************************************************/
FlagStatus ETH_GetSoftwareResetStatus(void)
{
  FlagStatus bitstatus = RESET;
  if((ETH->DMABMR & ETH_DMABMR_SR) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else 
  {
    bitstatus = RESET;
  }

  return bitstatus;
}

/*******************************************************************************
* Function Name  : ETH_GetlinkStaus
* Description    : Checks whether the internal 10BASE-T PHY is link or not.
* Input          : None.
* Return         : Internal 10BASE-T PHY is link or not.
*******************************************************************************/
FlagStatus ETH_GetlinkStaus (void)
{
    FlagStatus bitstatus = RESET;

    if((ETH->DMASR & 0x80000000) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*******************************************************************************
* Function Name  : ETH_GetDMAFlagStatus
* Description    : Checks whether the specified ETHERNET DMA flag is set or not.
* Input          : ETH_DMA_FLAG: specifies the flag to check.
*                  ETH_DMA_FLAG_TST : Time-stamp trigger flag
*                  ETH_DMA_FLAG_PMT : PMT flag
*                  ETH_DMA_FLAG_MMC : MMC flag
*                  ETH_DMA_FLAG_DataTransferError : Error bits 0-data buffer, 1-desc. access
*                  ETH_DMA_FLAG_ReadWriteError    : Error bits 0-write trnsf, 1-read transfr
*                  ETH_DMA_FLAG_AccessError       : Error bits 0-Rx DMA, 1-Tx DMA
*                  ETH_DMA_FLAG_NIS : Normal interrupt summary flag
*                  ETH_DMA_FLAG_AIS : Abnormal interrupt summary flag
*                  ETH_DMA_FLAG_ER  : Early receive flag
*                  ETH_DMA_FLAG_FBE : Fatal bus error flag
*                  ETH_DMA_FLAG_ET  : Early transmit flag
*                  ETH_DMA_FLAG_RWT : Receive watchdog timeout flag
*                  ETH_DMA_FLAG_RPS : Receive process stopped flag
*                  ETH_DMA_FLAG_RBU : Receive buffer unavailable flag
*                  ETH_DMA_FLAG_R   : Receive flag
*                  ETH_DMA_FLAG_TU  : Underflow flag
*                  ETH_DMA_FLAG_RO  : Overflow flag
*                  ETH_DMA_FLAG_TJT : Transmit jabber timeout flag
*                  ETH_DMA_FLAG_TBU : Transmit buffer unavailable flag
*                  ETH_DMA_FLAG_TPS : Transmit process stopped flag
*                  ETH_DMA_FLAG_T   : Transmit flag
* Return         : The new state of ETH_DMA_FLAG (SET or RESET).
*******************************************************************************/
FlagStatus ETH_GetDMAFlagStatus(uint32_t ETH_DMA_FLAG)
{  
  FlagStatus bitstatus = RESET;

  if ((ETH->DMASR & ETH_DMA_FLAG) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/*******************************************************************************
* Function Name  : ETH_DMAClearFlag
* Description    : Checks whether the specified ETHERNET DMA interrupt has occured or not.
* Input          : ETH_DMA_FLAG: specifies the flag to clear.
*                  ETH_DMA_FLAG_NIS : Normal interrupt summary flag
*                  ETH_DMA_FLAG_AIS : Abnormal interrupt summary flag
*                  ETH_DMA_FLAG_ER  : Early receive flag
*                  ETH_DMA_FLAG_FBE : Fatal bus error flag
*                  ETH_DMA_FLAG_ETI : Early transmit flag
*                  ETH_DMA_FLAG_RWT : Receive watchdog timeout flag
*                  ETH_DMA_FLAG_RPS : Receive process stopped flag
*                  ETH_DMA_FLAG_RBU : Receive buffer unavailable flag
*                  ETH_DMA_FLAG_R   : Receive flag
*                  ETH_DMA_FLAG_TU  : Transmit Underflow flag
*                  ETH_DMA_FLAG_RO  : Receive Overflow flag
*                  ETH_DMA_FLAG_TJT : Transmit jabber timeout flag
*                  ETH_DMA_FLAG_TBU : Transmit buffer unavailable flag
*                  ETH_DMA_FLAG_TPS : Transmit process stopped flag
*                  ETH_DMA_FLAG_T   : Transmit flag
* Return         : None.
*******************************************************************************/
void ETH_DMAClearFlag(uint32_t ETH_DMA_FLAG)
{
  ETH->DMASR = (uint32_t) ETH_DMA_FLAG;
}

