RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_eth.c
/*******************************************************************************
* Function Name  : ETH_GetDMAITStatus
* Description    : Checks whether the specified ETHERNET DMA interrupt has occured or not.
* Input          : ETH_DMA_IT: specifies the interrupt pending bit to clear.
*                  ETH_DMA_IT_TST : Time-stamp trigger interrupt
*                  ETH_DMA_IT_PMT : PMT interrupt
*                  ETH_DMA_IT_MMC : MMC interrupt
*                  ETH_DMA_IT_NIS : Normal interrupt summary
*                  ETH_DMA_IT_AIS : Abnormal interrupt summary
*                  ETH_DMA_IT_ER  : Early receive interrupt
*                  ETH_DMA_IT_FBE : Fatal bus error interrupt
*                  ETH_DMA_IT_ET  : Early transmit interrupt
*                  ETH_DMA_IT_RWT : Receive watchdog timeout interrupt
*                  ETH_DMA_IT_RPS : Receive process stopped interrupt
*                  ETH_DMA_IT_RBU : Receive buffer unavailable interrupt
*                  ETH_DMA_IT_R   : Receive interrupt
*                  ETH_DMA_IT_TU  : Underflow interrupt
*                  ETH_DMA_IT_RO  : Overflow interrupt
*                  ETH_DMA_IT_TJT : Transmit jabber timeout interrupt
*                  ETH_DMA_IT_TBU : Transmit buffer unavailable interrupt
*                  ETH_DMA_IT_TPS : Transmit process stopped interrupt
*                  ETH_DMA_IT_T   : Transmit interrupt
* Return         : The new state of ETH_DMA_IT (SET or RESET).
*******************************************************************************/
ITStatus ETH_GetDMAITStatus(uint32_t ETH_DMA_IT)
{  
  ITStatus bitstatus = RESET;

  if ((ETH->DMASR & ETH_DMA_IT) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/*******************************************************************************
* Function Name  : ETH_DMAClearITPendingBit
* Description    : Clears the ETHERNET’s DMA IT pending bit.
* Input          : ETH_DMA_IT: specifies the interrupt pending bit to clear.
*                  ETH_DMA_IT_NIS : Normal interrupt summary
*                  ETH_DMA_IT_AIS : Abnormal interrupt summary
*                  ETH_DMA_IT_ER  : Early receive interrupt
*                  ETH_DMA_IT_FBE : Fatal bus error interrupt
*                  ETH_DMA_IT_ETI : Early transmit interrupt
*                  ETH_DMA_IT_RWT : Receive watchdog timeout interrupt
*                  ETH_DMA_IT_RPS : Receive process stopped interrupt
*                  ETH_DMA_IT_RBU : Receive buffer unavailable interrupt
*                  ETH_DMA_IT_R   : Receive interrupt
*                  ETH_DMA_IT_TU  : Transmit Underflow interrupt
*                  ETH_DMA_IT_RO  : Receive Overflow interrupt
*                  ETH_DMA_IT_TJT : Transmit jabber timeout interrupt
*                  ETH_DMA_IT_TBU : Transmit buffer unavailable interrupt
*                  ETH_DMA_IT_TPS : Transmit process stopped interrupt
*                  ETH_DMA_IT_T   : Transmit interrupt
* Return         : None
*******************************************************************************/
void ETH_DMAClearITPendingBit(uint32_t ETH_DMA_IT)
{
  ETH->DMASR = (uint32_t) ETH_DMA_IT;
}

/*******************************************************************************
* Function Name  : ETH_GetTransmitProcessState
* Description    : Returns the ETHERNET DMA Transmit Process State.
* Input          : None.
* Return         : The new ETHERNET DMA Transmit Process State:
*                  ETH_DMA_TransmitProcess_Stopped   : Stopped - Reset or Stop Tx Command issued
*                  ETH_DMA_TransmitProcess_Fetching  : Running - fetching the Tx descriptor
*                  ETH_DMA_TransmitProcess_Waiting   : Running - waiting for status
*                  ETH_DMA_TransmitProcess_Reading   : unning - reading the data from host memory
*                  ETH_DMA_TransmitProcess_Suspended : Suspended - Tx Desciptor unavailabe
*                  ETH_DMA_TransmitProcess_Closing   : Running - closing Rx descriptor
*******************************************************************************/
uint32_t ETH_GetTransmitProcessState(void)
{
  return ((uint32_t)(ETH->DMASR & ETH_DMASR_TS)); 
}

/*******************************************************************************
* Function Name  : ETH_GetReceiveProcessState
* Description    : Returns the ETHERNET DMA Receive Process State.
* Input          : None.
* Return         : The new ETHERNET DMA Receive Process State:
*                  ETH_DMA_ReceiveProcess_Stopped   : Stopped - Reset or Stop Rx Command issued
*                  ETH_DMA_ReceiveProcess_Fetching  : Running - fetching the Rx descriptor
*                  ETH_DMA_ReceiveProcess_Waiting   : Running - waiting for packet
*                  ETH_DMA_ReceiveProcess_Suspended : Suspended - Rx Desciptor unavailable
*                  ETH_DMA_ReceiveProcess_Closing   : Running - closing descriptor
*                  ETH_DMA_ReceiveProcess_Queuing   : Running - queuing the recieve frame into host memory
*******************************************************************************/
uint32_t ETH_GetReceiveProcessState(void)
{
  return ((uint32_t)(ETH->DMASR & ETH_DMASR_RS)); 
}

/*******************************************************************************
* Function Name  : ETH_FlushTransmitFIFO
* Description    : Clears the ETHERNET transmit FIFO.
* Input          : None.
* Return         : None.
*******************************************************************************/
void ETH_FlushTransmitFIFO(void)
{
  ETH->DMAOMR |= ETH_DMAOMR_FTF;  
}

/*******************************************************************************
* Function Name  : ETH_GetFlushTransmitFIFOStatus
* Description    : Checks whether the ETHERNET transmit FIFO bit is cleared or not.
* Input          : None.
* Return         : The new state of ETHERNET flush transmit FIFO bit (SET or RESET).
*******************************************************************************/
FlagStatus ETH_GetFlushTransmitFIFOStatus(void)
{   
  FlagStatus bitstatus = RESET;
  if ((ETH->DMAOMR & ETH_DMAOMR_FTF) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus; 
}

