RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_eth.c
/*******************************************************************************
* Function Name  : ETH_DMATransmissionCmd
* Description    : Enables or disables the DMA transmission.
* Input          : NewState: new state of the DMA transmission.
* Return         : None
*******************************************************************************/
void ETH_DMATransmissionCmd(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ETH->DMAOMR |= ETH_DMAOMR_ST;  
  }
  else
  {
    ETH->DMAOMR &= ~ETH_DMAOMR_ST;
  }
}

/*******************************************************************************
* Function Name  : ETH_DMAReceptionCmd
* Description    : Enables or disables the DMA reception.
* Input          : NewState: new state of the DMA reception.
* Return         : None
*******************************************************************************/
void ETH_DMAReceptionCmd(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ETH->DMAOMR |= ETH_DMAOMR_SR;  
  }
  else
  {
    ETH->DMAOMR &= ~ETH_DMAOMR_SR;
  }
}

/*******************************************************************************
* Function Name  : ETH_DMAITConfig
* Description    : Enables or disables the specified ETHERNET DMA interrupts.
* Input          : ETH_DMA_IT: specifies the ETHERNET DMA interrupt sources to be enabled or disabled.
*                  ETH_DMA_IT_NIS : Normal interrupt summary
*                  ETH_DMA_IT_AIS : Abnormal interrupt summary
*                  ETH_DMA_IT_ER  : Early receive interrupt
*                  ETH_DMA_IT_FBE : Fatal bus error interrupt
*                  ETH_DMA_IT_ET  : Early transmit interrupt
*                  ETH_DMA_IT_RWT : Receive watchdog timeout interrupt
*                  ETH_DMA_IT_RPS : Receive process stopped interrupt
*                  ETH_DMA_IT_RBU : Receive buffer unavailable interrupt
*                  ETH_DMA_IT_R   : Receive interrupt
*                  ETH_DMA_IT_TU  : Underflow interrupt
*                  ETH_DMA_IT_RO  : Overflow interrupt
*                  ETH_DMA_IT_TJT : Transmit jabber timeout interrupt
*                  ETH_DMA_IT_TBU : Transmit buffer unavailable interrupt
*                  ETH_DMA_IT_TPS : Transmit process stopped interrupt
*                  ETH_DMA_IT_T   : Transmit interrupt
*                  ETH_DMA_Overflow_RxFIFOCounter : Overflow for FIFO Overflow Counter
*                  ETH_DMA_Overflow_MissedFrameCounter : Overflow for Missed Frame Counter
*                  NewState: new state of the specified ETHERNET DMA interrupts.
* Return         : new state of the specified ETHERNET DMA interrupts.
*******************************************************************************/
void ETH_DMAITConfig(uint32_t ETH_DMA_IT, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ETH->DMAIER |= ETH_DMA_IT;
  }
  else
  {
    ETH->DMAIER &=(~(uint32_t)ETH_DMA_IT);
  }
}

/*******************************************************************************
* Function Name  : ETH_GetDMAOverflowStatus
* Description    : Checks whether the specified ETHERNET DMA overflow flag is set or not.
* Input          : ETH_DMA_Overflow: specifies the DMA overflow flag to check.
*                  ETH_DMA_Overflow_RxFIFOCounter : Overflow for FIFO Overflow Counter
*                  ETH_DMA_Overflow_MissedFrameCounter : Overflow for Missed Frame Counter
* Return         : The new state of ETHERNET DMA overflow Flag (SET or RESET).
*******************************************************************************/
FlagStatus ETH_GetDMAOverflowStatus(uint32_t ETH_DMA_Overflow)
{
  FlagStatus bitstatus = RESET;
  
  if ((ETH->DMAMFBOCR & ETH_DMA_Overflow) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/*******************************************************************************
* Function Name  : ETH_GetRxOverflowMissedFrameCounter
* Description    : Get the ETHERNET DMA Rx Overflow Missed Frame Counter value.
* Input          : None.
* Return         : The value of Rx overflow Missed Frame Counter.
*******************************************************************************/
uint32_t ETH_GetRxOverflowMissedFrameCounter(void)
{
  return ((uint32_t)((ETH->DMAMFBOCR & ETH_DMAMFBOCR_MFA)>>ETH_DMA_RX_OVERFLOW_MISSEDFRAMES_COUNTERSHIFT));
}

/*******************************************************************************
* Function Name  : ETH_GetBufferUnavailableMissedFrameCounter
* Description    : Get the ETHERNET DMA Buffer Unavailable Missed Frame Counter value.
* Input          : None.
* Return         : The value of Buffer unavailable Missed Frame Counter.
*******************************************************************************/
uint32_t ETH_GetBufferUnavailableMissedFrameCounter(void)
{
  return ((uint32_t)(ETH->DMAMFBOCR) & ETH_DMAMFBOCR_MFC);
}

/*******************************************************************************
* Function Name  : ETH_GetCurrentTxDescStartAddress
* Description    : Get the ETHERNET DMA DMACHTDR register value.
* Input          : None.
* Return         : The value of the current Tx desc start address.
*******************************************************************************/
uint32_t ETH_GetCurrentTxDescStartAddress(void)
{
  return ((uint32_t)(ETH->DMACHTDR));
}

/*******************************************************************************
* Function Name  : ETH_GetCurrentRxDescStartAddress
* Description    : Get the ETHERNET DMA DMACHRDR register value.
* Input          : None.
* Return         : The value of the current Rx desc start address.
*******************************************************************************/
uint32_t ETH_GetCurrentRxDescStartAddress(void)
{
  return ((uint32_t)(ETH->DMACHRDR));
}

/*******************************************************************************
* Function Name  : ETH_GetCurrentTxBufferAddress
* Description    : Get the ETHERNET DMA DMACHTBAR register value.
* Input          : None.
* Return         : The value of the current Tx buffer address.
*******************************************************************************/
uint32_t ETH_GetCurrentTxBufferAddress(void)
{
    return (DMATxDescToSet->Buffer1Addr);
}

