RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_eth.c
/*******************************************************************************
* Function Name  : ETH_GetCurrentRxBufferAddress
* Description    : Get the ETHERNET DMA DMACHRBAR register value.
* Input          : None.
* Return         : The value of the current Rx buffer address.
*******************************************************************************/
uint32_t ETH_GetCurrentRxBufferAddress(void)
{
  return ((uint32_t)(ETH->DMACHRBAR));
}

/*******************************************************************************
* Function Name  : ETH_ResumeDMATransmission
* Description    : Resumes the DMA Transmission by writing to the DmaTxPollDemand register
* Input          : None.
* Return         : None.
*******************************************************************************/
void ETH_ResumeDMATransmission(void)
{
  ETH->DMATPDR = 0;
}

/*******************************************************************************
* Function Name  : ETH_ResumeDMAReception
* Description    : Resumes the DMA Transmission by writing to the DmaRxPollDemand register.
* Input          : None.
* Return         : None.
*******************************************************************************/
void ETH_ResumeDMAReception(void)
{
  ETH->DMARPDR = 0;
}

/*******************************************************************************
* Function Name  : ETH_ResetWakeUpFrameFilterRegisterPointer
* Description    : Reset Wakeup frame filter register pointer.
* Input          : None.
* Return         : None.
*******************************************************************************/
void ETH_ResetWakeUpFrameFilterRegisterPointer(void)
{  
  ETH->MACPMTCSR |= ETH_MACPMTCSR_WFFRPR;  
}

/*******************************************************************************
* Function Name  : ETH_SetWakeUpFrameFilterRegister
* Description    : Populates the remote wakeup frame registers.
* Input          : Buffer: Pointer on remote WakeUp Frame Filter Register buffer data (8 words).
* Return         : None
*******************************************************************************/
void ETH_SetWakeUpFrameFilterRegister(uint32_t *Buffer)
{
  uint32_t i = 0;
  
  for(i =0; i<ETH_WAKEUP_REGISTER_LENGTH; i++)
  {
    ETH->MACRWUFFR = Buffer[i];
  }
}

/*******************************************************************************
* Function Name  : ETH_GlobalUnicastWakeUpCmd
* Description    : Enables or disables any unicast packet filtered by the MAC address.
* Input          : NewState: new state of the MAC Global Unicast Wake-Up.
* Return         : None
*******************************************************************************/
void ETH_GlobalUnicastWakeUpCmd(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ETH->MACPMTCSR |= ETH_MACPMTCSR_GU;  
  }
  else
  {
    ETH->MACPMTCSR &= ~ETH_MACPMTCSR_GU;
  }
}

/*******************************************************************************
* Function Name  : ETH_GetPMTFlagStatus
* Description    : Checks whether the specified ETHERNET PMT flag is set or not.
* Input          : ETH_PMT_FLAG: specifies the flag to check.
* Return         : The new state of ETHERNET PMT Flag (SET or RESET).
*******************************************************************************/
FlagStatus ETH_GetPMTFlagStatus(uint32_t ETH_PMT_FLAG)
{
    FlagStatus bitstatus = RESET;

    if ((ETH->MACPMTCSR & ETH_PMT_FLAG) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/*******************************************************************************
* Function Name  : ETH_WakeUpFrameDetectionCmd
* Description    : Enables or disables the MAC Wake-Up Frame Detection.
* Input          : NewState: new state of the MAC Wake-Up Frame Detection.
* Return         : None.
*******************************************************************************/
void ETH_WakeUpFrameDetectionCmd(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ETH->MACPMTCSR |= ETH_MACPMTCSR_WFE;  
  }
  else
  {
    ETH->MACPMTCSR &= ~ETH_MACPMTCSR_WFE;
  }
}

/*******************************************************************************
* Function Name  : ETH_MagicPacketDetectionCmd
* Description    : Enables or disables the MAC Magic Packet Detection.
* Input          : NewState: new state of the MAC Magic Packet Detection.
* Return         : None.
*******************************************************************************/
void ETH_MagicPacketDetectionCmd(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ETH->MACPMTCSR |= ETH_MACPMTCSR_MPE;  
  }
  else
  {
    ETH->MACPMTCSR &= ~ETH_MACPMTCSR_MPE;
  }
}

/*******************************************************************************
* Function Name  : ETH_PowerDownCmd
* Description    : Enables or disables the MAC Power Down.
* Input          : NewState: new state of the MAC Power Down.
* Return         : None.
*******************************************************************************/
void ETH_PowerDownCmd(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ETH->MACPMTCSR |= ETH_MACPMTCSR_PD;  
  }
  else
  {
    ETH->MACPMTCSR &= ~ETH_MACPMTCSR_PD;
  }
}

/*******************************************************************************
* Function Name  : ETH_MMCCounterFreezeCmd
* Description    : Enables or disables the MMC Counter Freeze.
* Input          : NewState: new state of the MMC Counter Freeze.
* Return         : None.
*******************************************************************************/
void ETH_MMCCounterFreezeCmd(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ETH->MMCCR |= ETH_MMCCR_MCF;
  }
  else
  {
    ETH->MMCCR &= ~ETH_MMCCR_MCF;
  }
}

/*******************************************************************************
* Function Name  : ETH_MMCResetOnReadCmd
* Description    : Enables or disables the MMC Reset On Read.
* Input          : NewState: new state of the MMC Reset On Read.
* Return         : None.
*******************************************************************************/
void ETH_MMCResetOnReadCmd(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ETH->MMCCR |= ETH_MMCCR_ROR; 
  }
  else
  {
    ETH->MMCCR &= ~ETH_MMCCR_ROR;
  }
}

