RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_eth.c
/*******************************************************************************
* Function Name  : ETH_MMCCounterRolloverCmd
* Description    : Enables or disables the MMC Counter Stop Rollover.
* Input          : NewState: new state of the MMC Counter Stop Rollover.
* Return         : None.
*******************************************************************************/
void ETH_MMCCounterRolloverCmd(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ETH->MMCCR &= ~ETH_MMCCR_CSR;
  }
  else
  {
    ETH->MMCCR |= ETH_MMCCR_CSR; 
  }
}

/*******************************************************************************
* Function Name  : ETH_MMCCountersReset
* Description    : Resets the MMC Counters.
* Input          : None.
* Return         : None.
*******************************************************************************/
void ETH_MMCCountersReset(void)
{
  ETH->MMCCR |= ETH_MMCCR_CR; 
}

/*******************************************************************************
* Function Name  : ETH_MMCITConfig
* Description    : Enables or disables the specified ETHERNET MMC interrupts.
* Input          : ETH_MMC_IT: specifies the ETHERNET MMC interrupt.
*                  ETH_MMC_IT_TGF   : When Tx good frame counter reaches half the maximum value.
*                  ETH_MMC_IT_TGFMSC: When Tx good multi col counter reaches half the maximum value.
*                  ETH_MMC_IT_TGFSC : When Tx good single col counter reaches half the maximum value.
*                  ETH_MMC_IT_RGUF  : When Rx good unicast frames counter reaches half the maximum value.
*                  ETH_MMC_IT_RFAE  : When Rx alignment error counter reaches half the maximum value.
*                  ETH_MMC_IT_RFCE  : When Rx crc error counter reaches half the maximum value.
* Input          : NewState: new state of the specified ETHERNET MMC interrupts.
* Return         : None.
*******************************************************************************/
void ETH_MMCITConfig(uint32_t ETH_MMC_IT, FunctionalState NewState)
{
  if ((ETH_MMC_IT & (uint32_t)0x10000000) != (uint32_t)RESET)
  {
    ETH_MMC_IT &= 0xEFFFFFFF;
  
    if (NewState != DISABLE)
    {
      ETH->MMCRIMR &=(~(uint32_t)ETH_MMC_IT);
    }
    else
    {
      ETH->MMCRIMR |= ETH_MMC_IT;    
    }
  }
  else
  {
    if (NewState != DISABLE)
    {
      ETH->MMCTIMR &=(~(uint32_t)ETH_MMC_IT);
    }
    else
    {
      ETH->MMCTIMR |= ETH_MMC_IT;    
    }  
  }
}

/*******************************************************************************
* Function Name  : ETH_GetMMCITStatus
* Description    : Checks whether the specified ETHERNET MMC IT is set or not.
* Input          : ETH_MMC_IT: specifies the ETHERNET MMC interrupt.
*                  ETH_MMC_IT_TxFCGC: When Tx good frame counter reaches half the maximum value.
*                  ETH_MMC_IT_TxMCGC: When Tx good multi col counter reaches half the maximum value.
*                  ETH_MMC_IT_TxSCGC: When Tx good single col counter reaches half the maximum value .
*                  ETH_MMC_IT_RxUGFC: When Rx good unicast frames counter reaches half the maximum value.
*                  ETH_MMC_IT_RxAEC : When Rx alignment error counter reaches half the maximum value.
*                  ETH_MMC_IT_RxCEC : When Rx crc error counter reaches half the maximum value.
* Return         : The value of ETHERNET MMC IT (SET or RESET).
*******************************************************************************/
ITStatus ETH_GetMMCITStatus(uint32_t ETH_MMC_IT)
{
  ITStatus bitstatus = RESET;
  
  if ((ETH_MMC_IT & (uint32_t)0x10000000) != (uint32_t)RESET)
  {
    if ((((ETH->MMCRIR & ETH_MMC_IT) != (uint32_t)RESET)) && ((ETH->MMCRIMR & ETH_MMC_IT) != (uint32_t)RESET))
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }
  else
  {
    if ((((ETH->MMCTIR & ETH_MMC_IT) != (uint32_t)RESET)) && ((ETH->MMCRIMR & ETH_MMC_IT) != (uint32_t)RESET))
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }  
  }    
    
  return bitstatus;
}

/*******************************************************************************
* Function Name  : ETH_GetMMCRegister
* Description    : Get the specified ETHERNET MMC register value.
* Input          : ETH_MMCReg: specifies the ETHERNET MMC register.
*                  ETH_MMCCR      : MMC CR register
*                  ETH_MMCRIR     : MMC RIR register
*                  ETH_MMCTIR     : MMC TIR register
*                  ETH_MMCRIMR    : MMC RIMR register
*                  ETH_MMCTIMR    : MMC TIMR register
*                  ETH_MMCTGFSCCR : MMC TGFSCCR register
*                  ETH_MMCTGFMSCCR: MMC TGFMSCCR register
*                  ETH_MMCTGFCR   : MMC TGFCR register
*                  ETH_MMCRFCECR  : MMC RFCECR register
*                  ETH_MMCRFAECR  : MMC RFAECR register
*                  ETH_MMCRGUFCR  : MMC RGUFCRregister
* Return         : The value of ETHERNET MMC Register value.
*******************************************************************************/
uint32_t ETH_GetMMCRegister(uint32_t ETH_MMCReg)
{
  return (*(__IO uint32_t *)(ETH_MAC_BASE + ETH_MMCReg));
}

/*******************************************************************************
* Function Name  : ETH_EnablePTPTimeStampAddend
* Description    : Updated the PTP block for fine correction with the Time Stamp Addend register value.
* Input          : None.
* Return         : None.
*******************************************************************************/
void ETH_EnablePTPTimeStampAddend(void)
{
  ETH->PTPTSCR |= ETH_PTPTSCR_TSARU;    
}

/*******************************************************************************
* Function Name  : ETH_EnablePTPTimeStampInterruptTrigger
* Description    : Enable the PTP Time Stamp interrupt trigger
* Input          : None.
* Return         : None.
*******************************************************************************/
void ETH_EnablePTPTimeStampInterruptTrigger(void)
{
  ETH->PTPTSCR |= ETH_PTPTSCR_TSITE;    
}

