RT-Thread/rt-thread/bsp/wch/arm/libraries/CH32F20x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f20x_eth.c
/*******************************************************************************
* Function Name  : ETH_EnablePTPTimeStampUpdate
* Description    : Updated the PTP system time with the Time Stamp Update register value.
* Input          : None.
* Return         : None.
*******************************************************************************/
void ETH_EnablePTPTimeStampUpdate(void)
{
  ETH->PTPTSCR |= ETH_PTPTSCR_TSSTU;    
}

/*******************************************************************************
* Function Name  : ETH_InitializePTPTimeStamp
* Description    : Initialize the PTP Time Stamp.
* Input          : None.
* Return         : None.
*******************************************************************************/
void ETH_InitializePTPTimeStamp(void)
{
  ETH->PTPTSCR |= ETH_PTPTSCR_TSSTI;    
}

/*******************************************************************************
* Function Name  : ETH_PTPUpdateMethodConfig
* Description    : Selects the PTP Update method.
* Input          : UpdateMethod: the PTP Update method.
* Return         : None.
*******************************************************************************/
void ETH_PTPUpdateMethodConfig(uint32_t UpdateMethod)
{
  if (UpdateMethod != ETH_PTP_CoarseUpdate)
  {
    ETH->PTPTSCR |= ETH_PTPTSCR_TSFCU;
  }
  else
  {
    ETH->PTPTSCR &= (~(uint32_t)ETH_PTPTSCR_TSFCU);
  } 
}

/*******************************************************************************
* Function Name  : ETH_PTPTimeStampCmd
* Description    : Enables or disables the PTP time stamp for transmit and receive frames.
* Input          : NewState: new state of the PTP time stamp for transmit and receive frames.
* Return         : None.
*******************************************************************************/
void ETH_PTPTimeStampCmd(FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    ETH->PTPTSCR |= ETH_PTPTSCR_TSE;
  }
  else
  {
    ETH->PTPTSCR &= (~(uint32_t)ETH_PTPTSCR_TSE);
  }
}

/*******************************************************************************
* Function Name  : ETH_GetPTPFlagStatus
* Description    : Checks whether the specified ETHERNET PTP flag is set or not.
* Input          : ETH_PTP_FLAG: specifies the flag to check.
* Return         : The new state of ETHERNET PTP Flag (SET or RESET).
*******************************************************************************/
FlagStatus ETH_GetPTPFlagStatus(uint32_t ETH_PTP_FLAG)
{
  FlagStatus bitstatus = RESET;
  
  if ((ETH->PTPTSCR & ETH_PTP_FLAG) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/*******************************************************************************
* Function Name  : ETH_SetPTPSubSecondIncrement
* Description    : Sets the system time Sub-Second Increment value.
* Input          : SubSecondValue: specifies the PTP Sub-Second Increment Register value.
* Return         : None.
*******************************************************************************/
void ETH_SetPTPSubSecondIncrement(uint32_t SubSecondValue)
{
  ETH->PTPSSIR = SubSecondValue;    
}

/*******************************************************************************
* Function Name  : ETH_SetPTPTimeStampUpdate
* Description    : Sets the Time Stamp update sign and values.
* Input          : Sign: specifies the PTP Time update value sign.
*                  SecondValue: specifies the PTP Time update second value.
*                  SubSecondValue: specifies the PTP Time update sub-second value.
* Return         : None.
*******************************************************************************/
void ETH_SetPTPTimeStampUpdate(uint32_t Sign, uint32_t SecondValue, uint32_t SubSecondValue)
{
  ETH->PTPTSHUR = SecondValue;
  ETH->PTPTSLUR = Sign | SubSecondValue;   
}

/*******************************************************************************
* Function Name  : ETH_SetPTPTimeStampAddend
* Description    : Sets the Time Stamp Addend value.
* Input          : Value: specifies the PTP Time Stamp Addend Register value.
* Return         : None.
*******************************************************************************/
void ETH_SetPTPTimeStampAddend(uint32_t Value)
{
  /* Set the PTP Time Stamp Addend Register */
  ETH->PTPTSAR = Value;    
}

/*******************************************************************************
* Function Name  : ETH_SetPTPTargetTime
* Description    : Sets the Target Time registers values.
* Input          : HighValue: specifies the PTP Target Time High Register value.
*                  LowValue: specifies the PTP Target Time Low Register value.
* Return         : None.
*******************************************************************************/
void ETH_SetPTPTargetTime(uint32_t HighValue, uint32_t LowValue)
{
  ETH->PTPTTHR = HighValue;
  ETH->PTPTTLR = LowValue;    
}

/*******************************************************************************
* Function Name  : ETH_GetPTPRegister
* Description    : Get the specified ETHERNET PTP register value.
* Input          : ETH_PTPReg: specifies the ETHERNET PTP register.
*                ETH_PTPTSCR  : Sub-Second Increment Register
*                ETH_PTPSSIR  : Sub-Second Increment Register
*                ETH_PTPTSHR  : Time Stamp High Register
*                ETH_PTPTSLR  : Time Stamp Low Register
*                ETH_PTPTSHUR : Time Stamp High Update Register
*                ETH_PTPTSLUR : Time Stamp Low Update Register
*                ETH_PTPTSAR  : Time Stamp Addend Register
*                ETH_PTPTTHR  : Target Time High Register
*                ETH_PTPTTLR  : Target Time Low Register
* Return         : The value of ETHERNET PTP Register value.
*******************************************************************************/
uint32_t ETH_GetPTPRegister(uint32_t ETH_PTPReg)
{
  return (*(__IO uint32_t *)(ETH_MAC_BASE + ETH_PTPReg));
}

/*******************************************************************************
* Function Name  : ETH_DMAPTPTxDescChainInit
* Description    : Initializes the DMA Tx descriptors in chain mode with PTP.
* Input          : DMATxDescTab: Pointer on the first Tx desc list.
*                  DMAPTPTxDescTab: Pointer on the first PTP Tx desc list.
*                  TxBuff: Pointer on the first TxBuffer list.
*                  TxBuffCount: Number of the used Tx desc in the list.
* Return         : None.
*******************************************************************************/
void ETH_DMAPTPTxDescChainInit(ETH_DMADESCTypeDef *DMATxDescTab, ETH_DMADESCTypeDef *DMAPTPTxDescTab,
                               uint8_t* TxBuff, uint32_t TxBuffCount)
{
  uint32_t i = 0;
  ETH_DMADESCTypeDef *DMATxDesc;
  
  DMATxDescToSet = DMATxDescTab;
  DMAPTPTxDescToSet = DMAPTPTxDescTab;

